# MetalPatternScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Metal..::..MetalPatternScale Property
Metal Class See Also
---
The property labeled "Scale" from the "Metal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalPatternScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalPatternScale As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalPatternScale {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" with a minimum of "0".
# See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace